{
    "navPortifolio": "Portifolio",
    "navResume": "Resume",
    "navContact": "Contact",
    "homeAboutMe": "About Me",
    "homeDescription": "I'm a passionate software developer with proficiency in a range of cutting-edge technologies.",
    "homeDescription2": " My expertise spans C#, .NET, Angular, React, Flutter, and MySQL. I possess a solid track record in creating high-performance and scalable software solutions.",
    "homeFeaturedProject": "Featured Project",
    "Pokedex em Angular/PokeApi": "Pokedex in Angular/PokeApi",
    "PokeDex Online: Explore, Descubra e Desafie-se": "PokeDex Online: Explore, Discover and Challenge Yourself",
    "homeLearnMore": "Visit the Portifolio section to learn more!",
    "Apresento minha PokeDex online, uma plataforma que oferece uma rica experiência de pesquisa sobre Pokémon. Na Home Page, explore uma lista paginada e ordenada, realizando pesquisas por nome ou tipo. Detalhes minuciosos, como estatísticas de ataque, defesa, altura e peso, são revelados na página dedicada a cada Pokémon. Para adicionar um toque de diversão, integrei um jogo inspirado no 'Who's that Pokémon?', desafiando os usuários a adivinhar o nome do Pokémon ao ver apenas sua sombra. Mergulhe neste universo Pokémon interativo e descubra o fascínio por trás de cada criatura! 🌟🔍": "I present my online PokeDex, a platform that offers a rich Pokémon research experience. On the Home Page, explore a paginated and ordered list, searching by name or type. Minute details such as attack, defense, height and weight statistics are revealed on the page dedicated to each Pokémon. To add a touch of fun, I integrated a game inspired by 'Who's that Pokémon?', challenging users to guess the Pokémon's name by just seeing its shadow. Immerse yourself in this interactive Pokémon universe and discover the fascination behind each creature! 🌟🔍",
    "portifolioFilter": "Filter",
    "cardViewMore": "View More",
    "Chat multiplataforma com SignalR": "Cross-platform chat with SignalR",
    "Chat em Tempo Real com React, ASP.NET e Flutter": "Real-Time Chat with React, ASP.NET and Flutter",
    "Explore este repositório que destaca a integração do SignalR em um projeto de chat em tempo real. Com front-end em React para uma interface amigável, back-end em ASP.NET gerenciando a lógica do chat, e um aplicativo móvel em Flutter com integração ao OneSignal para uma experiência completa em dispositivos móveis. 🚀":"Explore this repository highlighting SignalR integration in a real-time chat project. With a React front-end for a user-friendly interface, an ASP.NET back-end managing chat logic, and a Flutter mobile app with OneSignal integration for a complete experience on mobile devices. 🚀",
    "Explorando o Mundo do Cinema com o Flutter e a API do The Movie DB": "Exploring the World of Cinema with Flutter and The Movie DB API",
    "Um aplicativo de filmes desenvolvido em Flutter com a poderosa API do The Movie DB. Navegue por uma vasta coleção de filmes, descubra detalhes fascinantes e mergulhe em uma experiência cinematográfica única, tudo na palma da sua mão! 🎬✨": "A movie app built in Flutter with the powerful API from The Movie DB. Browse a vast collection of films, discover fascinating details and immerse yourself in a unique cinematic experience, all in the palm of your hand! 🎬✨",
    "Simulador de pagamento":"Payment simulator",
    "Simulando Transações Financeiras com Facilidade": "Simulating Financial Transactions with Ease",
    "Explore o AngularPay, um projeto inovador que visa simular o envio de dinheiro entre usuários por meio de cartão de crédito. Navegue pela lista de usuários na primeira tela, escolha um destinatário e inicie o processo de pagamento. Um modal intuitivo apresenta as informações do destinatário, opções de cartão de crédito e um botão para efetuar o pagamento. Completando o formulário, o usuário aciona um endpoint de pagamento que determina o sucesso ou falha da transação, exibindo um modal correspondente. Uma experiência simples e eficiente para simular transferências financeiras! 💸🌐": "Explore AngularPay, an innovative project that aims to simulate sending money between users via credit card. Browse the list of users on the first screen, choose a recipient and start the payment process. An intuitive modal presents recipient information, credit card options, and a button to make payment. Completing the form, the user triggers a payment endpoint that determines the success or failure of the transaction, displaying a corresponding modal. A simple and efficient experience to simulate financial transfers! 💸🌐",
    "Explorando Mapas e Pokédex": "Exploring Maps and Pokédex",
    "Testei os limites da programação com o Gameboy Pokemon, um projeto audacioso onde desenvolvi um Game Boy em Flutter em apenas dois dias. Neste jogo, os jogadores podem movimentar o personagem pelo mapa, entrar em casas e acessar uma Pokédex completa, alimentada pela pokeAPI. Uma jornada intensiva que resultou em um emocionante desafio de codificação, trazendo à vida um universo de aventuras em tempo recorde! 🚀🎮": "I tested the limits of programming with Gameboy Pokemon, an audacious project where I developed a Game Boy in Flutter in just two days. In this game, players can move their character around the map, enter houses and access a complete Pokédex, powered by pokeAPI. An intensive journey that resulted in an exciting coding challenge, bringing to life a universe of adventures in record time! 🚀🎮",
    "Clone Responsivo da Netflix com API do The MovieDB": "Netflix Responsive Clone with The MovieDB API",
    "Explore o ReactFlix, meu projeto que recria a página inicial da Netflix utilizando React e a API poderosa do The MovieDB. Desfrute de uma experiência totalmente responsiva, perfeita para desktops e dispositivos móveis, enquanto navega por uma extensa coleção de filmes e séries. Este projeto não apenas demonstra minhas habilidades em React, mas também destaca meu comprometimento com a qualidade e a adaptabilidade em todos os dispositivos. Confira este e outros projetos no meu portfólio de desenvolvedor! 🎬🖥️📱": "Explore ReactFlix, my project that recreates the Netflix homepage using React and The MovieDB's powerful API. Enjoy a fully responsive experience, perfect for desktop and mobile devices, as you browse an extensive collection of movies and series. This project not only demonstrates my React skills, but also highlights my commitment to quality and adaptability across devices. Check out this and other projects in my developer portfolio! 🎬🖥️📱",
    "modalDescription": "Description",
    "modalLink":"You can find this project on Github",
    "modalHere":"here",
    "resumeBtnDownload": "Download PDF Resume",
    "resumeWorkExp": "Work Experience",
    "resumeDateExp": "nov 2021 - nov 2023",
    "resumeDateExp2": "fev de 2024 - current",
    "resumeAssignment1": "Web development using Angular",
    "resumeAssignment2": "Desktop development using Windows Forms",
    "resumeAssignment3": "Mobile development using Angular and Flutter",
    "resumeAssignment4": "Backend development using REST API and Docker",
    "resumeAssignment2.1": "development using React",
    "resumeAssignment2.2": "development using Next.js",
    "resumeEducation": "Education",
    "resumeEducation1": "Bachelor's degree",
    "resumeEducationDate": "Aug 2021 - Aug 2024",
    "resumeCertifications": "Certifications",
    "resumeCertifications1": "Full Modern Web Course with JavaScript",
    "resumeCertificationsDate": "Obtainded fev 2022",
    "resumeCertifications2": "Object Oriented Programming in .NET",
    "resumeCertificationsDate2": "Obtainded fev 2021",
    "resumeCertifications3": "Fundamentals of Systems Architecture.",
    "resumeCertificationsDate3": "Obtainded fev 2021",
    "resumeSkills": "Skills",
    "resumeSkillsLP": "Programing languages:",
    "resumeSkillsOS": "Other Skills:",
    "resumeSkillsSCG": "Source Control via Git",
    "resumeSkillsAD": "Agile Development",
    "resumeSkillsMVC": "MVC Architecture",
    "contact": "Contact",
    "contactEmail": "I acan be reached at the following email:",
    "contactPlatforms": "Feel free to connect with me on any of the following platforms:"

}